{
  "elementy_planowania_przestrzennego": "Przedmiot ten stanowi dogłębną analizę polskiego systemu planowania przestrzennego, skupiając się na jego aspektach proceduralnych i merytorycznych oraz silnym powiązaniu z ochroną środowiska. Kluczowe jest zrozumienie hierarchii i struktury planowania na poziomie krajowym, regionalnym i gminnym. Centralnym elementem jest analiza najważniejszych dokumentów: Studium Uwarunkowań i Kierunków Zagospodarowania Przestrzennego (SUiKZG), jego statusu prawnego i zawartości, oraz Miejscowego Planu Zagospodarowania Przestrzennego (MPZP), który jest aktem prawa miejscowego i określa zasady zabudowy. Omawiana jest także rola decyzji o warunkach zabudowy (WZ) w przypadku braku MPZP. Niezwykle istotnym aspektem przedmiotu są narzędzia ochrony środowiska integrowane w procesie planistycznym. Należą do nich opracowania ekofizjograficzne, stanowiące diagnozę stanu środowiska, oraz prognozy oddziaływania na środowisko, które są obowiązkowe dla SUiKZG i MPZP. Przedmiot obejmuje również metodykę waloryzacji przyrodniczej terenu oraz śledzenie krok po kroku procedur lokalizacji inwestycji i uchwalania planów miejscowych.",
  "oczyszczanie_wody_i_sciekow_2": "Jest to zaawansowany kurs inżynierii procesu, koncentrujący się na technologiach oczyszczania ścieków i przeróbki osadów ściekowych. Punktem wyjścia jest charakterystyka ścieków (BZT5, ChZT, azot, fosfor) i przypomnienie procesów mechanicznych. Główny nacisk położony jest na szczegółową analizę procesów biologicznych. Obejmuje to usuwanie związków węgla, ale przede wszystkim zintegrowane usuwanie biogenów. Szczegółowo omawiane są dwa kluczowe procesy: usuwanie azotu poprzez nitryfikację (warunki tlenowe, przemiana NH4 w NO3) i denitryfikację (warunki anoksyczne, redukcja NO3 do N2), oraz biologiczne usuwanie fosforu (BFU/EBPR), które wymaga sekwencji stref beztlenowych i tlenowych oraz działania bakterii PAO. Analizowane są również różne typy reaktorów, jak systemy z osadem czynnym i złożem biologicznym. Równie ważnym modułem jest kompletna ścieżka gospodarki osadowej, obejmująca procesy stabilizacji (np. fermentację metanową), zagęszczanie, odwadnianie (np. prasami, wirówkami), suszenie oraz ostateczne metody zagospodarowania osadu.",
  "prawodawstwo_w_ochronie_srodowiska": "Przedmiot ten to kompendium wiedzy o systemie prawnym ochrony środowiska w Polsce i UE, przedstawione z perspektywy prawa administracyjnego. Obejmuje analizę hierarchii źródeł prawa (od Konstytucji, przez ustawy i dyrektywy UE, po akty prawa miejscowego) oraz szczegółowy opis kompetencji i zadań poszczególnych organów administracji (np. GIOŚ, WIOŚ, RDOŚ, Marszałek, Starosta). Kluczowa jest analiza najważniejszych ustaw sektorowych: Prawo ochrony środowiska (POŚ), Prawo wodne oraz ustawy o odpadach. Najważniejszą częścią przedmiotu jest omówienie procedur administracyjnych i instrumentów prawnych. Dotyczy to pozwoleń sektorowych (wodnoprawnych, na emisję gazów i pyłów, odpadowych) oraz centralnego instrumentu, jakim jest pozwolenie zintegrowane (IPPC), wymagane dla największych instalacji. Osobny, ważny moduł stanowi procedura Oceny Oddziaływania na Środowisko (OOŚ) dla planowanych przedsięwzięć, kończąca się wydaniem decyzji środowiskowej.",
  "procesy_przenoszenia_masy_i_energii": "Jest to fundamentalny przedmiot inżynierii procesowej, wyjaśniający fizyczne prawa rządzące transportem. Opiera się na ogólnej zasadzie bilansowania masy, energii i pędu. Szczegółowo rozróżnia i analizuje trzy główne mechanizmy transportu: dyfuzję (transport molekularny, wywołany gradientem, opisywany prawami Ficka, Fouriera i Newtona), adwekcję/konwekcję (transport wywołany makroskopowym przepływem płynu) oraz radiację (dla ciepła). Kluczowym konceptem jest analogia między procesami przenoszenia pędu, ciepła i masy (np. analogia Reynoldsa), która pozwala na przenoszenie wiedzy między tymi trzema obszarami. Przedmiot mocno rozróżnia charakter przepływu, wyjaśniając, jak w przepływie turbulentnym dominuje dyfuzja turbulentna (wirowa), znacznie intensywniejsza od molekularnej. Ostatnim ważnym zagadnieniem jest transport międzyfazowy, wyjaśniany przez koncepcję warstwy granicznej (prędkości, termicznej, stężeniowej) i opisujący procesy na granicach faz, np. napowietrzanie na granicy powietrze-woda.",
  "racjonalne_gospodarowanie_energia": "Przedmiot ten łączy aspekty zarządcze, prawne i technologiczne w celu osiągnięcia efektywności energetycznej, głównie w skali komunalnej i w budownictwie. Omawiane są ramy prawne, w tym ustawa Prawo Energetyczne oraz rola gminy w planowaniu zaopatrzenia w energię. Główny nacisk położony jest na narzędzia zarządcze: audyty energetyczne, które są podstawą do planowania termomodernizacji (obejmującej ocieplenie, wymianę okien, modernizację źródeł ciepła). Omawiane są również świadectwa charakterystyki energetycznej (certyfikaty energetyczne) i definicje budynków pasywnych. W części technologicznej analizowane są rozwiązania o wysokiej sprawności, przede wszystkim kogeneracja (jednoczesna produkcja ciepła i prądu) i trigeneracja, a także rola miejskich systemów ciepłowniczych. Kurs porusza również tematykę wykorzystania biopaliw oraz może zawierać dyskusję na temat innych nośników energii, np. energii jądrowej.",
  "systemy_informacji_przestrzennej": "Jest to techniczny i metodyczny kurs na temat teorii i praktyki Systemów Informacji Geograficznej. Fundamentalnym zagadnieniem jest szczegółowe porównanie dwóch głównych modeli reprezentacji danych: modelu wektorowego, który opisuje świat za pomocą obiektów (punkty, linie, poligony) i przechowuje dane opisowe w tabelach atrybutów, oraz modelu rastrowego, który reprezentuje świat jako siatkę komórek (pikseli) o określonych wartościach, idealną dla danych ciągłych (jak temperatura czy wysokość). Omawiane są główne źródła pozyskiwania danych: digitalizacja (wektoryzacja map), teledetekcja (obrazy satelitarne, zdjęcia lotnicze) oraz pomiary GPS. Przedmiot skupia się na metodach reprezentacji rzeźby terenu, głównie poprzez Numeryczny Model Terenu (NMT/DEM), który jest zazwyczaj rastrem, oraz model TIN (sieć nieregularnych trójkątów). Omawiane są także podstawowe analizy przestrzenne, takie jak buforowanie czy nakładanie warstw (overlay), oraz popularne oprogramowanie typu ArcGIS (ArcView) czy MapInfo.",
  "alternatywne_zrodla_energii": "Przedmiot ten stanowi kompleksowy przegląd technologii odnawialnych i alternatywnych źródeł energii (OZE). Dla każdej technologii analizowane są: zasada działania, potencjał (zasoby) oraz aspekty technologiczne, ekonomiczne i ekologiczne. Szczegółowo omawiana jest energetyka słoneczna, z wyraźnym podziałem na fotowoltaikę (PV) konwertującą promieniowanie na prąd oraz kolektory termiczne produkujące ciepło, wraz z metodami obliczania nasłonecznienia. Drugim filarem jest energetyka wiatrowa (turbiny lądowe i morskie). Obszernie analizowana jest energia biomasy, obejmująca spalanie paliw stałych (drewno, słoma), produkcję biogazu w procesie fermentacji metanowej oraz biopaliwa płynne. Kurs pokrywa również energetykę wodną oraz energię geotermalną, ze szczególnym uwzględnieniem zasad działania pomp ciepła. Na koniec omawiane są technologie przyszłości, takie jak wykorzystanie wodoru jako nośnika energii, ogniwa paliwowe oraz kluczowy problem magazynowania energii."
}